%测试代码，为了测试以下C语言循环：
% for (x = i; x < i + 4; ++x)
			% 	{
			% 		x1 = A[x][j]; x2 = A[x][j+1]; x3 = A[x][j+2]; x4 = A[x][j+3];
			% 		x5 = A[x][j+4]; x6 = A[x][j+5]; x7 = A[x][j+6]; x8 = A[x][j+7];
					
			% 		B[j][x] = x1; B[j+1][x] = x2; B[j+2][x] = x3; B[j+3][x] = x4;
			% 		B[j][x+4] = x5; B[j+1][x+4] = x6; B[j+2][x+4] = x7; B[j+3][x+4] = x8;
			% 	}
			% 	for (y = j; y < j + 4; ++y)
			% 	{
			% 		x1 = A[i+4][y]; x2 = A[i+5][y]; x3 = A[i+6][y]; x4 = A[i+7][y];
			% 		x5 = B[y][i+4]; x6 = B[y][i+5]; x7 = B[y][i+6]; x8 = B[y][i+7];
					
			% 		B[y][i+4] = x1; B[y][i+5] = x2; B[y][i+6] = x3; B[y][i+7] = x4;
			% 		B[y+4][i] = x5; B[y+4][i+1] = x6; B[y+4][i+2] = x7; B[y+4][i+3] = x8;
			% 	}
			% 	for (x = i + 4; x < i + 8; ++x)
			% 	{
			% 		x1 = A[x][j+4]; x2 = A[x][j+5]; x3 = A[x][j+6]; x4 = A[x][j+7];
			% 		B[j+4][x] = x1; B[j+5][x] = x2; B[j+6][x] = x3; B[j+7][x] = x4;
			% 	}
			% }



%创建两个8*8矩阵A和B
A = [1 2 3 4 5 6 7 8; 9 10 11 12 13 14 15 16; 17 18 19 20 21 22 23 24; 25 26 27 28 29 30 31 32; 33 34 35 36 37 38 39 40; 41 42 43 44 45 46 47 48; 49 50 51 52 53 54 55 56; 57 58 59 60 61 62 63 64];
%B为零矩阵
B = zeros(8,8);

%测试
i = 1;
j = 1;
for x = i:i+3
        x1 = A(x,j); x2 = A(x,j+1); x3 = A(x,j+2); x4 = A(x,j+3);
        x5 = A(x,j+4); x6 = A(x,j+5); x7 = A(x,j+6); x8 = A(x,j+7);
        
        B(j,x) = x1; B(j+1,x) = x2; B(j+2,x) = x3; B(j+3,x) = x4;
        B(j,x+4) = x5; B(j+1,x+4) = x6; B(j+2,x+4) = x7; B(j+3,x+4) = x8;
end
%输出两个矩阵
A
B

for y = j:j+3
        x1 = A(i+4,y); x2 = A(i+5,y); x3 = A(i+6,y); x4 = A(i+7,y);
        x5 = B(y,i+4); x6 = B(y,i+5); x7 = B(y,i+6); x8 = B(y,i+7);
        
        B(y,i+4) = x1; B(y,i+5) = x2; B(y,i+6) = x3; B(y,i+7) = x4;
        B(y+4,i) = x5; B(y+4,i+1) = x6; B(y+4,i+2) = x7; B(y+4,i+3) = x8;
end
A
B
for x = i+4:i+7
        x1 = A(x,j+4); x2 = A(x,j+5); x3 = A(x,j+6); x4 = A(x,j+7);
        B(j+4,x) = x1; B(j+5,x) = x2; B(j+6,x) = x3; B(j+7,x) = x4;
end
A
B


